In [6]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns=['one','two'])

In [3]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [4]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [6]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [7]:
df.mean(axis='columns',skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [8]:
df.mean(axis='columns',skipna=True)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [9]:
df.mean(skipna=False)

one   NaN
two   NaN
dtype: float64

In [10]:
df.mean(skipna=True)

one    3.083333
two   -2.900000
dtype: float64

In [12]:
df.idxmax()

one    b
two    d
dtype: object

In [13]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [14]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [18]:
obj=pd.Series(['a','a','b','c']*4)
obj
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [34]:
! type C:\Users\Yangyang\examples\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [37]:
df=pd.read_csv('ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [38]:
pd.read_table('ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [39]:
! type C:\Users\Yangyang\examples\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [43]:
pd.read_csv(r'C:\Users\Yangyang\examples\ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [44]:
pd.read_csv(r'C:\Users\Yangyang\examples\ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [45]:
names=['a','b','c','d','message']
pd.read_csv(r'C:\Users\Yangyang\examples\ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [46]:
! type C:\Users\Yangyang\examples\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [47]:
parsed = pd.read_csv(r'C:\Users\Yangyang\examples\csv_mindex.csv',index_col=['key1','key2'])

In [48]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [56]:
list(open('/Users/Yangyang/examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [57]:
result = pd.read_table('/Users/Yangyang/examples/ex3.txt',sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [60]:
! type C:\Users\Yangyang\examples\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [61]:
pd.read_csv(r'C:\Users\Yangyang\examples\ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [62]:
! type C:\Users\Yangyang\examples\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [64]:
result = pd.read_csv(r'C:\Users\Yangyang\examples\ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [65]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [66]:
result=pd.read_csv(r'C:\Users\Yangyang\examples\ex5.csv',na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [67]:
sentinels={'message':['foo','NA'],'something':['two']}
pd.read_csv(r'C:\Users\Yangyang\examples\ex5.csv',na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [68]:
pd.options.display.max_rows=10
result=pd.read_csv(r'C:\Users\Yangyang\examples\ex6.csv')

In [69]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [71]:
pd.read_csv(r'C:\Users\Yangyang\examples\ex6.csv',nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [72]:
chunker=pd.read_csv(r'C:\Users\Yangyang\examples\ex6.csv',chunksize=1000)
chunker

In [73]:
chunker=pd.read_csv(r'C:\Users\Yangyang\examples\ex6.csv',chunksize=1000)
tot=pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value=0)
tot=tot.sort_values(ascending=False)

In [74]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [75]:
data=pd.read_csv(r'C:\Users\Yangyang\examples\ex5.csv')

In [76]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [77]:
conda install pandas-datareader

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

## Package Plan ##

  environment location: C:\python3\111

  added / updated specs:
    - pandas-datareader


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    conda-4.7.12               |           py37_0         3.0 MB
    pandas-datareader-0.8.0    |             py_0          71 KB
    ------------------------------------------------------------
                                           Total:         3.1 MB

The following NEW packages will be INSTALLED:

  pandas-datareader  pkgs/main/noarch::pandas-datareader-0.8.0-py_0

The following packages will be UPDATED:

  conda                                       4.7.10-py37_0 --> 4.7.12-py37_0



Downloading and Extracting Packages

pandas-datareader-0. | 71 KB     |            |   0%
pandas-datareader-0. | 71 KB     | ##2        |  23%
pandas-datareader-0. | 71 KB     | ########## | 100%

conda-4.7.12         | 3.0 MB    |            |   0%
conda-4.7.12         | 3.0 MB    |            |   1%
conda-4.7.12         | 3.0 MB    | 6          |   6%
conda-4.7.12         | 3.0 MB    | 8          |   8%
conda-4.7.12         | 3.0 MB    | #1         |  12%
conda-4.7.12         | 3.0 MB    | #6         |  16%
conda-4.7.12         | 3.0 MB    | ##         |  21%
conda-4.7.12         | 3.0 MB    | ##6        |  27%
conda-4.7.12         | 3.0 MB    | ###3       |  33%
conda-4.7.12         | 3.0 MB    | ###9       |  39%
conda-4.7.12         | 3.0 MB    | ####6      |  46%
conda-4.7.12         | 3.0 MB    | #####3     |  54%
conda-4.7.12         | 3.0 MB    | ######     |  61%
conda-4.7.12         | 3.0 MB    | ######8    |  68%
conda-4.7.12         | 3.0 MB    | #######6   |  76%
conda-4.7.12         | 3.0 MB    | ########3  |  83%
conda-4.7.12         | 3.0 MB    | #########  |  91%
conda-4.7.12         | 3.0 MB    | #########7 |  98%
conda-4.7.12         | 3.0 MB    | ########## | 100%
Preparing transaction: ...working... done
Verifying transaction: ...working... done
Executing transaction: ...working... done

Note: you may need to restart the kernel to use updated packages.

In [78]:
import pandas_datareader.data as web

In [79]:
all_data={ticker:web.get_data_yahoo(ticker)
         for ticker in['AAPL','IBM','MSFT','GOOG']}
price=pd.DataFrame({ticker:data['Adj Close']
                   for ticker,data in all_data.items()})
volume=pd.DataFrame({ticker:data['Volume']
                    for ticker,data in all_data.items()})

In [80]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-10-15 -0.002332  0.006759  0.014475  0.021255
2019-10-16 -0.004037 -0.006224 -0.008194  0.000507
2019-10-17  0.003883 -0.055239 -0.005128  0.007583
2019-10-18  0.004803 -0.001266 -0.016322 -0.006049
2019-10-21  0.017343 -0.011261  0.007423  0.000530

In [81]:
returns['MSFT'].corr(returns['IBM'])

0.48674517703240827

In [82]:
returns['MSFT'].cov(returns['IBM'])

9.388633405708515e-05

In [83]:
returns.MSFT.corr(returns.IBM)

0.48674517703240827

In [84]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.405581  0.572918  0.520953
IBM   0.405581  1.000000  0.486745  0.413015
MSFT  0.572918  0.486745  1.000000  0.654477
GOOG  0.520953  0.413015  0.654477  1.000000

In [85]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000247  0.000083  0.000133  0.000124
IBM   0.000083  0.000170  0.000094  0.000082
MSFT  0.000133  0.000094  0.000219  0.000147
GOOG  0.000124  0.000082  0.000147  0.000231

In [87]:
returns.corrwith(returns.IBM)

AAPL    0.405581
IBM     1.000000
MSFT    0.486745
GOOG    0.413015
dtype: float64

In [88]:
returns.corrwith(volume)

AAPL   -0.115887
IBM    -0.130734
MSFT   -0.082384
GOOG   -0.007324
dtype: float64

In [89]:
obj=pd.Series(['c','a','d','a','a','b','b','c','c'])
uniques=obj.unique()

In [91]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [92]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [95]:
pd.value_counts(obj.values,sort=False)

c    3
a    3
b    2
d    1
dtype: int64

In [96]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [97]:
mask =obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [98]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [99]:
to_match=pd.Series(['c','a','b','b','c','a'])
unique_vals=pd.Series(['c','b','a'])
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)